{
  "planets": [
    {
      "x": [
        0.004502508845301258,
        0.0007670734814646406,
        0.0002660563278120356
      ],
      "v": [
        -3.5174423541454e-7,
        0.00000517762777222281,
        0.00000222910220557907
      ],
      "m": 1,
      "r":  0.004654692513368984,
      "color": "#e4e80e",
      "name": "Sun",
      "map": "models/sun.glb",
      "info": "The Sun—the heart of our solar system—is a yellow dwarf star, a hot ball of glowing gases. Its gravity holds the solar system together, keeping everything from the biggest planets to the smallest particles of debris in its orbit. Electric currents in the Sun generate a magnetic field that is carried out through the solar system by the solar wind—a stream of electrically charged gas blowing outward from the Sun in all directions.The connection and interactions between the Sun and Earth drive the seasons, ocean currents, weather, climate, radiation belts and aurorae. Though it is special to us, there are billions of stars like our Sun scattered across the Milky Way galaxy."
    },
    {
      "x": [
        0.3572602064472754,
        -0.09154904243051842,
        -0.08598103998694037
      ],
      "v": [
        0.0033678456621937854,
        0.02488934284224929,
        0.012944071586795967
      ],
      "m": 1.6601367952719304e-7,
      "r": 0.000016308155080213903,
      "color": "#d5dedb",
      "name": "Mecury",
      "map": "models/mercury.glb",
      "info": "The smallest planet in our solar system and nearest to the Sun, Mercury is only slightly larger than Earth's Moon. From the surface of Mercury, the Sun would appear more than three times as large as it does when viewed from Earth, and the sunlight would be as much as seven times brighter. Despite its proximity to the Sun, Mercury is not the hottest planet in our solar system – that title belongs to nearby Venus, thanks to its dense atmosphere."
    },
    {
      "x": [
        0.6082494331856041,
        -0.34913244319590053,
        -0.19554434578540694
      ],
      "v": [
        0.010952420109908838,
        0.01561250673986247,
        0.006328876451746665
      ],
      "m": 0.0000024478383396645447,
      "r": 0.000040453208556149734,
      "color": "#fcba03",
      "name": "Venus",
      "map": "models/venus.glb",
      "info": "Similar in size and structure to Earth, Venus has been called Earth's twin. These are not identical twins, however – there are radical differences between the two worlds. Venus has a thick, toxic atmosphere filled with carbon dioxide and it’s perpetually shrouded in thick, yellowish clouds of mostly sulfuric acid that trap heat, causing a runaway greenhouse effect. It’s the hottest planet in our solar system, even though Mercury is closer to the Sun. Venus has crushing air pressure at its surface – more than 90 times that of Earth – similar to the pressure you'd encounter a mile below the ocean on Earth. Venus was the first planet to be explored by a spacecraft – NASA’s Mariner 2 successfully flew by and scanned the cloud-covered world on Dec. 14, 1962. Since then, numerous spacecraft from the U.S. and other space agencies have explored Venus, including NASA’s Magellan, which mapped the planet's surface with radar. The former Soviet Union is the only nation to land on the surface of Venus to date, though the spacecraft did not survive long in the harsh environment."
    },
    {
      "x": [
        0.11601490913916648,
        -0.9266055536403852,
        -0.40180627760698806
      ],
      "v": [
        0.01681162005220229,
        0.0017431316879820316,
        0.0007559737671361461
      ],
      "m": 0.0000030404326333266026,
      "r": 0.000042586898395721926,
      "color": "#10cdde",
      "name": "Earth",
      "map": "models/earth.glb",
      "info": "Our home planet is the third planet from the Sun, and the only place we know of so far that’s inhabited by living things. While Earth is only the fifth largest planet in the solar system, it is the only world in our solar system with liquid water on the surface. Just slightly larger than nearby Venus, Earth is the biggest of the four planets closest to the Sun, all of which are made of rock and metal.The name Earth is at least 1,000 years old. All of the planets, except for Earth, were named after Greek and Roman gods and goddesses. However, the name Earth is a Germanic word, which simply means “the ground.”"
    },
    {
      "x": [
        -0.1146885824390927,
        -1.3283665308334882,
        -0.6061551894193808
      ],
      "v": [
        0.014482004807944747,
        0.00023728549236071137,
        -0.000283749836102397
      ],
      "m": 3.2271514450538743e-7,
      "r": 0.000022657085561497327,
      "color": "#de5110",
      "name": "Mars",
      "map": "models/mars.glb",
      "info": "​Mars is the fourth planet from the Sun – a dusty, cold, desert world with a very thin atmosphere. Mars is also a dynamic planet with seasons, polar ice caps, canyons, extinct volcanoes, and evidence that it was even more active in the past. Mars is one of the most explored bodies in our solar system, and it's the only planet where we've sent rovers to roam the alien landscape. Two NASA rovers and one lander are currently exploring the surface of Mars (and a Chinese lander is set to land later this year). An international fleet of eight orbiters are studying the Red Planet from above. These robotic explorers have found lots of evidence that Mars was much wetter and warmer, with a thicker atmosphere, billions of years ago. NASA's next-generation Perseverance rover – the largest, most advanced rover NASA has sent to another world – touched down on Mars on Feb. 18, 2021, after a 203-day journey traversing 293 million miles (472 million kilometers). Confirmation of the successful touchdown was announced in mission control at NASA’s Jet Propulsion Laboratory (JPL) at 3:55 p.m. EST (12:55 p.m. PST). Perseverance is one of three spacecraft that arrived at Mars in 2021. The Hope orbiter from the United Arab Emirates arrived on Feb. 9, 2021. China’s Tianwen-1 mission arrived on Feb. 10, 2021, and includes an orbiter, a lander, and a rover. Europa and India also have spacecraft studying Mars from orbit."
    },
    {
      "x": [
        -5.384209406992146,
        -0.8312476561610839,
        -0.2250947570335499
      ],
      "v": [
        0.0010923632912184977,
        -0.0065232941911922675,
        -0.002823012267219439
      ],
      "m": 0.0009547919384243222,
      "r": 0.00046731951871657756,
      "color": "#fa8b57",
      "name": "Jupiter",
      "map": "models/jupiter.glb",
      "info": "Jupiter has a long history surprising scientists—all the way back to 1610 when Galileo Galilei found the first moons beyond Earth. That discovery changed the way we see the universe. Fifth in line from the Sun, Jupiter is, by far, the largest planet in the solar system – more than twice as massive as all the other planets combined. Jupiter's familiar stripes and swirls are actually cold, windy clouds of ammonia and water, floating in an atmosphere of hydrogen and helium. Jupiter’s iconic Great Red Spot is a giant storm bigger than Earth that has raged for hundreds of years. One spacecraft — NASA's Juno orbiter — is currently exploring this giant world."
    },
    {
      "x": [
        7.889889933822818,
        4.595710726926013,
        1.5584315167250897
      ],
      "v": [
        -0.0032172034910936636,
        0.004330632233555691,
        0.0019264174637994528
      ],
      "m": 0.0002858859806661029,
      "r": 0.0003892513368983957,
      "color": "#ffec73",
      "name": "Saturn",
      "map": "models/Saturn.glb",
      "info": "Saturn is the sixth planet from the Sun and the second largest planet in our solar system. Adorned with thousands of beautiful ringlets, Saturn is unique among the planets. It is not the only planet to have rings—made of chunks of ice and rock—but none are as spectacular or as complicated as Saturn's. Like fellow gas giant Jupiter, Saturn is a massive ball made mostly of hydrogen and helium."
    },
    {
      "x": [
        -18.269900814978268,
        -1.1627115802190469,
        -0.25036954074255485
      ],
      "v": [
        0.00022154016562741063,
        -0.0037676535582461617,
        -0.0016532438049223935
      ],
      "m": 0.000043662440433515637,
      "r": 0.00016953208556149733,
      "color": "#b8fff4",
      "name": "Uranus",
      "map": "models/Uranus.glb",
      "info": "The first planet found with the aid of a telescope, Uranus was discovered in 1781 by astronomer William Herschel, although he originally thought it was either a comet or a star. It was two years later that the object was universally accepted as a new planet, in part because of observations by astronomer Johann Elert Bode. Herschel tried unsuccessfully to name his discovery Georgium Sidus after King George III. Instead the scientific community accepted Bode's suggestion to name it Uranus, the Greek god of the sky, as suggested by Bode.​"
    },
    {
      "x": [
        -16.059545091924463,
        -23.942948290879503,
        -9.400422780354008
      ],
      "v": [
        0.0026431227915765616,
        -0.0015034920807587946,
        -0.0006812710048723478
      ],
      "m": 0.00005151389020535497,
      "r": 0.0001645855614973262,
      "color": "#2e5cf2",
      "name": "Neptune",
      "map": "models/Neptune.glb",
      "info": "Dark, cold and whipped by supersonic winds, ice giant Neptune is the eighth and most distant planet in our solar system. More than 30 times as far from the Sun as Earth, Neptune is the only planet in our solar system not visible to the naked eye and the first predicted by mathematics before its discovery. In 2011 Neptune completed its first 165-year orbit since its discovery in 1846. NASA's Voyager 2 is the only spacecraft to have visited Neptune up close. It flew past in 1989 on its way out of the solar system."
    },
    {
      "x": [
        -30.487822112155552,
        -0.8732454301967293,
        8.911296984184755
      ],
      "v": [
        0.00032256219593323327,
        -0.0031487479275516053,
        -0.0010801779315936957
      ],
      "m": 7.396449704142012e-9,
      "r": 0.000007943181818181818,
      "color": "#fffcc2",
      "name": "Pluto",
      "map": "models/Pluto.glb",
      "info": "Pluto – which is smaller than Earth’s Moon – has a heart-shaped glacier that’s the size of Texas and Oklahoma. This fascinating world has blue skies, spinning moons, mountains as high as the Rockies, and it snows – but the snow is red. On July 14, 2015, NASA’s New Horizons spacecraft made its historic flight through the Pluto system – providing the first close-up images of Pluto and its moons and collecting other data that has transformed our understanding of these mysterious worlds on the solar system’s outer frontier. In the years since that groundbreaking flyby, nearly every conjecture about Pluto possibly being an inert ball of ice has been thrown out the window or flipped on its head. “It’s clear to me that the solar system saved the best for last!” said Alan Stern, New Horizons principal investigator from the Southwest Research Institute, Boulder, Colorado. “We could not have explored a more fascinating or scientifically important planet at the edge of our solar system. The New Horizons team worked for 15 years to plan and execute this flyby and Pluto paid us back in spades!”"
    },
    {
      "x": [
        -30.487822112155552,
        -0.8732454301967293,
        8.911296984184755
      ],
      "v": [
        0.00032256219593323327,
        -0.0031487479275516053,
        -0.0010801779315936957
      ],
      "m": 7.396449704142012e-9,
      "r": 0.000007943181818181818,
      "color": "#fffcc2",
      "name": "Ceres",
      "map": "models/Pluto.glb",
      "info": "Pluto – which is smaller than Earth’s Moon – has a heart-shaped glacier that’s the size of Texas and Oklahoma. This fascinating world has blue skies, spinning moons, mountains as high as the Rockies, and it snows – but the snow is red. On July 14, 2015, NASA’s New Horizons spacecraft made its historic flight through the Pluto system – providing the first close-up images of Pluto and its moons and collecting other data that has transformed our understanding of these mysterious worlds on the solar system’s outer frontier. In the years since that groundbreaking flyby, nearly every conjecture about Pluto possibly being an inert ball of ice has been thrown out the window or flipped on its head. “It’s clear to me that the solar system saved the best for last!” said Alan Stern, New Horizons principal investigator from the Southwest Research Institute, Boulder, Colorado. “We could not have explored a more fascinating or scientifically important planet at the edge of our solar system. The New Horizons team worked for 15 years to plan and execute this flyby and Pluto paid us back in spades!”"
    }
  ],
  "G": 2.95912208286e-4
}